IDENTIFICATION DIVISION.
       PROGRAM-ID. ADD-CONNECTION.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CONNECTIONS-FILE ASSIGN TO "data/connections.dat"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CONNECTIONS-FILE.
       01 CONNECTION-REC.
           05 USERNAME-ONE        PIC X(20).
           05 USERNAME-TWO        PIC X(20).

       LINKAGE SECTION.
       01 L-USER1 PIC X(20).
       01 L-USER2 PIC X(20).

       PROCEDURE DIVISION USING L-USER1 L-USER2.
           OPEN EXTEND CONNECTIONS-FILE
           
           MOVE L-USER1 TO USERNAME-ONE
           MOVE L-USER2 TO USERNAME-TWO
           
           WRITE CONNECTION-REC
           CLOSE CONNECTIONS-FILE
           GOBACK.

       END PROGRAM ADD-CONNECTION.