       IDENTIFICATION DIVISION.
       PROGRAM-ID. INCOLLEGE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-COMMAND  PIC X(20).
       77 WS-LINE     PIC X(80).
       77 WS-USERNAME PIC X(20).
       77 WS-PASSWORD PIC X(20).
       77 WS-MESSAGE  PIC X(80).
       77 WS-CHOICE   PIC 9.

       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           MOVE "OPEN" TO WS-COMMAND
           CALL "IO-MODULE" USING WS-COMMAND WS-LINE

           MOVE "Welcome to InCollege!" TO WS-LINE
           MOVE "WRITE" TO WS-COMMAND
           CALL "IO-MODULE" USING WS-COMMAND WS-LINE

           MOVE "1. Log In" TO WS-LINE
           MOVE "WRITE" TO WS-COMMAND
           CALL "IO-MODULE" USING WS-COMMAND WS-LINE

           MOVE "2. Create New Account" TO WS-LINE
           MOVE "WRITE" TO WS-COMMAND
           CALL "IO-MODULE" USING WS-COMMAND WS-LINE

           MOVE "READ" TO WS-COMMAND
           CALL "IO-MODULE" USING WS-COMMAND WS-LINE
           MOVE FUNCTION NUMVAL(WS-LINE(1:1)) TO WS-CHOICE

           EVALUATE WS-CHOICE
              WHEN 1
                   MOVE "LOGIN" TO WS-COMMAND
                   CALL "ACCOUNT-MGMT" USING WS-COMMAND WS-USERNAME 
                   WS-PASSWORD WS-MESSAGE
                   MOVE "WRITE" TO WS-COMMAND
                   CALL "IO-MODULE" USING WS-COMMAND WS-MESSAGE
              WHEN 2
                   MOVE "READ" TO WS-COMMAND
                   CALL "IO-MODULE" USING WS-COMMAND WS-USERNAME
                   MOVE "READ" TO WS-COMMAND
                   CALL "IO-MODULE" USING WS-COMMAND WS-PASSWORD

                   MOVE "CREATE" TO WS-COMMAND
                   CALL "ACCOUNT-MGMT" USING WS-COMMAND WS-USERNAME 
                   WS-PASSWORD WS-MESSAGE

                   MOVE "WRITE" TO WS-COMMAND
                   CALL "IO-MODULE" USING WS-COMMAND WS-MESSAGE
              WHEN OTHER
                   MOVE "Invalid choice" TO WS-LINE
                   MOVE "WRITE" TO WS-COMMAND
                   CALL "IO-MODULE" USING WS-COMMAND WS-LINE
           END-EVALUATE

           MOVE "CLOSE" TO WS-COMMAND
           CALL "IO-MODULE" USING WS-COMMAND WS-LINE

           STOP RUN.
      *END PROGRAM INCOLLEGE.
